app/Controllers/Main.php

    public function admin()
    {
        if (array_key_exists('user_session', session()->get())) {
            $qturl_m = new \App\Models\CuteUrl();
            $user = session()->get('user_session');

            $data['user'] = $user;
            $data['urls'] = $qturl_m
                ->where('user_id', $user['id'])
                ->orderBy('dtc', 'desc')
                ->findAll();
---
SELECT *
FROM `cute_url`
WHERE `user_id` = '1'
ORDER BY `dtc` DESC

    public function users()
    {
        if (array_key_exists('user_session', session()->get())) {

            $user_m = new \App\Models\UserAccount();

            $user = session()->get('user_session');

            if (array_key_exists('user_id', $this->request->getGet())) {

                $data['edit_user'] = $user_m->find($this->request->getGet('user_id'));
            }

            $data['user'] = $user;
            $data['users'] = $user_m
                ->where('id !=', $user['id'])
                ->orderBy('dtc', 'desc')
                ->findAll();
---
SELECT *
FROM `users`
WHERE `id` != '1'
ORDER BY `dtc` DESC

                    {
                        $shorten = random_string('alnum',4);

                        $user_short->save([
                        'source_url' => $source,
                        'target_code'=>$shorten
                        ]);
---
INSERT INTO `cute_url` (`source_url`, `target_code`) VALUES ('https://tabs.ultimate-guitar.com/tab/hillsong-worship/your-love-is-beautiful-chords-335859', 'ftMh')